---
title: ACADExportOptions
classe: Autodesk.Revit.DB.ACADExportOptions
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BaseExportOptions
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# ACADExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ACAObjectPreference ACAPreference { get; set; }` | `aCADExportOptions.ACAPreference` | ACAObjectPreference |
| `Boolean ExportingAreas { get; set; }` | `aCADExportOptions.ExportingAreas` | Boolean |
| `SolidGeometry ExportOfSolids { get; set; }` | `aCADExportOptions.ExportOfSolids` | SolidGeometry |
| `ACADVersion FileVersion { get; set; }` | `aCADExportOptions.FileVersion` | ACADVersion |
| `Color HatchBackgroundColor { get; set; }` | `aCADExportOptions.HatchBackgroundColor` | Color |
| `LineScaling LineScaling { get; set; }` | `aCADExportOptions.LineScaling` | LineScaling |
| `String LinetypesFileName { get; set; }` | `aCADExportOptions.LinetypesFileName` | String |
| `Boolean MarkNonplotLayers { get; set; }` | `aCADExportOptions.MarkNonplotLayers` | Boolean |
| `String NonplotSuffix { get; set; }` | `aCADExportOptions.NonplotSuffix` | String |
| `Boolean SharedCoords { get; set; }` | `aCADExportOptions.SharedCoords` | Boolean |
| `ExportUnit TargetUnit { get; set; }` | `aCADExportOptions.TargetUnit` | ExportUnit |
| `TextTreatment TextTreatment { get; set; }` | `aCADExportOptions.TextTreatment` | TextTreatment |
| `Boolean UseHatchBackgroundColor { get; set; }` | `aCADExportOptions.UseHatchBackgroundColor` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```